1. Create DataFrame from Lists

In [1]:
import pandas as pd

In [2]:
#create Dataframe from dict of equal length lists
#Last five olymics data: place,year and number of countries participited

olympic_data_list = {'HostCity':['Landon','Baijing','Athens','Sydney','Atlanta'],
                    'Year':[2012,2008,2004,2000,1996],
                    'No. of Participting Countries':[205,204,201,200,197]}

In [3]:
#pass the list to the data frme
df_olympic_data = pd.DataFrame(olympic_data_list)

In [4]:
df_olympic_data

  HostCity  Year  No. of Participting Countries
0   Landon  2012                            205
1  Baijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197

2. Create DataFrame from dict of dicts

In [5]:
olympic_data_dict = {'London':{2012:205},'Beijing':{2008:204}}

In [8]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [9]:
df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

3. view DataFrame

In [10]:
#select by city name
df_olympic_data.HostCity

0     Landon
1    Baijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [12]:
#use describe function to display the content
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  No. of Participting Countries
0   Landon  2012                            205
1  Baijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197>

4. create a dataframe from dict of series

In [14]:
olympic_series_participations = pd.Series([205,204,201,200,197],index =[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['Landon','Baijing','Athens','Sydney','Atlanta'],index =[2012,2008,2004,2000,1996])

In [15]:
df_olympic_series = pd.DataFrame({'No. of Participating countries' : olympic_series_participations,'HostCity':olympic_series_country})

In [16]:
df_olympic_series

      No. of Participating countries HostCity
2012                             205   Landon
2008                             204  Baijing
2004                             201   Athens
2000                             200   Sydney
1996                             197  Atlanta

5. Create DataFrame from ndarray

In [18]:
import numpy as np

In [19]:
np_array  = np.array([2012,2008,2004,2006])
dict_ndarray = {'year' : np_array}

In [20]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [21]:
df_ndarray

   year
0  2012
1  2008
2  2004
3  2006

6. Create DataFrame from DataFrame

In [24]:
#df_olympic_series is another data frame
df_from_df = pd.DataFrame(df_olympic_series)

In [23]:
df_from_df

      No. of Participating countries HostCity
2012                             205   Landon
2008                             204  Baijing
2004                             201   Athens
2000                             200   Sydney
1996                             197  Atlanta

7. view data

In [25]:
#view dataFrame discribe
df_olympic_series.describe

<bound method NDFrame.describe of       No. of Participating countries HostCity
2012                             205   Landon
2008                             204  Baijing
2004                             201   Athens
2000                             200   Sydney
1996                             197  Atlanta>

In [27]:
#View top 2 record
df_olympic_series.head(2)

      No. of Participating countries HostCity
2012                             205   Landon
2008                             204  Baijing

In [28]:
#view indexes of dataset
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [29]:
#view last 3 record
df_olympic_series.tail(3)

      No. of Participating countries HostCity
2004                             201   Athens
2000                             200   Sydney
1996                             197  Atlanta

In [31]:
#view columns of the dataset
df_olympic_series.columns

Index(['No. of Participating countries', 'HostCity'], dtype='object')

8.Select data

In [37]:
#Select data from host cities
df_olympic_series['HostCity']

2012     Landon
2008    Baijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: HostCity, dtype: object

In [38]:
#another data selection no. of Participating Countries
df_olympic_series['No. of Participating countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of Participating countries, dtype: int64

In [39]:
#Select Lable-location based access by label
df_olympic_series.loc[2012]

No. of Participating countries       205
HostCity                          Landon
Name: 2012, dtype: object

In [41]:
#Integer - location based data selection by index value
df_olympic_series.iloc[2:4]

      No. of Participating countries HostCity
2004                             201   Athens
2000                             200   Sydney

In [ ]:
#select data element by condition where number of participeted countries are more than 200